2020-12-21-emacs-bookmarks.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/faq/rss.xml"
      title="RSS feed for https://martiyo.github.io/faq/"
    />
    <title>Emacs Bookmarks</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/faq">/home</a></li>
          <li><a href="https://martiyo.github.io/faq/about">/about</a></li>
          <li><a href="https://martiyo.github.io/faq/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">21 dic 2020</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/faq/2020-12-21-emacs-bookmarks.html"
          >Emacs Bookmarks</a
        >
      </h1>

      <div id="outline-container-org12ca3af" class="outline-2">
        <h2 id="org12ca3af">
          <a href="https://www.emacswiki.org/emacs/BookMarks">Emacs Wiki</a>
        </h2>
        <div class="outline-text-2" id="text-org12ca3af">
          <p>
            Los marcadores registran ubicaciones para que puedas volver a ellas
            más tarde. Los marcadores de Emacs utilizan tres cosas que están
            relacionadas pero son diferentes: una lista de marcadores , un
            archivo de marcadores y una pantalla de lista de marcadores .
            Comprenderlos es importante para usar los marcadores de Emacs.
          </p>

          <p>Algunos comandos de marcadores para comenzar:</p>

          <ul class="org-ul">
            <li>
              <b>C-x r m</b> establece un marcador en la ubicacion actual.
            </li>

            <li><b>C-x r b</b> salta a un marcador.</li>

            <li><b>C-x r l</b> lista marcadores.</li>

            <li><b>M-x bookmark-delete</b> elimina un marcador.</li>
          </ul>

          <p>
            La opción ‘bookmark-default-file’ define un archivo bookmarks , que
            por defecto es ` ~/.emacs.d/bookmarks` en las versiones más
            recientes. Emacs mantiene el archivo automáticamente a medida que
            crea, cambia y elimina marcadores.
          </p>
        </div>
      </div>

      <div id="outline-container-orgd023208" class="outline-2">
        <h2 id="orgd023208">Lista de marcadores</h2>
        <div class="outline-text-2" id="text-orgd023208">
          <p>
            El comando <b>bookmark-bmenu-list</b>, vinculado a <b>C-x r l</b>,
            proporciona un menú conveniente para acceder a los marcadores. La
            lista es como un dired para marcadores
          </p>
        </div>
      </div>

      <div id="outline-container-org8edbc27" class="outline-2">
        <h2 id="org8edbc27">Claves en <b>bookmark list</b>:</h2>
        <div class="outline-text-2" id="text-org8edbc27">
          <ul class="org-ul">
            <li><b>a</b> mostrar anotación para el marcador actual.</li>

            <li><b>A</b> mostrar todas las anotaciónes para sus marcadores.</li>

            <li>
              <b>d</b> marcar varias entradas para borrarlas(<b>x</b> para
              borrarlas)
            </li>

            <li><b>e</b> editar anotación del marcador actual.</li>

            <li>
              <b>m</b> marcar varias entradas para visualización y otras
              operaciones, ( <b>v</b> para visitar)
            </li>

            <li>
              <b>o</b> visitar el marcador actual en otra ventana, mateniendo
              abierta la lista de marcadores.
            </li>

            <li><b>C-o</b> cambiar al marcador actual en otro ventana.</li>

            <li><b>r</b> cambiar el nombre del marcador actual.</li>
          </ul>

          <p>
            Esto es solo un <code>miniresumen</code> de
            <a href="https://www.emacswiki.org/emacs/BookMarks">Emacs Wiki</a>
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/faq/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/faq/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/faq/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
